# Задача 1. Фруктовый сад

a, b, c = 8, 5, 3
res = ((a / (b + c)) - a) / c
print(res)

# Задача 2. Автобус или метро?

bus = 5
metro = 3
result = ((6 + (10 - bus) ** 2)) / (metro + 1) + 132 / (2 + bus)
print(result)

# Задача 3. Сложные степени

print((-3 + (8 ** 2 - 12) * 4 ** 3 ** 2) / (2 * 18))
