# Задача 1. Координаты точки

# Задача 2. Отрезок
a = int(input("Введите первое число: "))
b = int(input("Введите второе число: "))

print(f"Сумма {a + b}")

c = int(input("Введите третье число: "))
d = int(input("Введите четвёртое число: "))
res = 2 * (c + 5 + (a * b) / (4 * b)) * (d - 2 * (a ** 3 / 30)) - 10
print(res)

# Задача 3. Исправление ошибки

a = '2'
b = '5'
c = '3'
num = 6 ** int(a) + (7 - int(b)) * int(c)
print(num)
