# Задача 1. Выражения

print(6 * 39)
print(3 ** 5)
print(-8 / -4)
print(10 / 2 + 6)

# Задача 2. Эти замечательные астрологи

a, b, c, = 23, 12, 2
print(f"Сложение: {a + b + c}")
print(f"Разность: {a - b - c}")
print(f"Умножение: {a * b * c}")
print(f"Деление: {a / b / c}")
print(f"Возведение в степень: {a ** b ** c}")

# Задача 3. Деление на ноль

print(65 / 0)

# ZeroDivisionError
