# Задача 1. Ставки на спорт

# bid = int(input("Сколько ставим? "))
# coefficient = float(input("Какой коэффициент? "))
# print(f"Потенциальный выигрыш: {round(bid * coefficient, 2)}")

# Задача 2. День рождения

# age = int(input("Введите возраст: "))
# temperature = float(input("Введите температуру: "))
# print(f"Подарок на день рождения: {round(age * 1.5 * temperature, 0)} рублей")

# Задача 3. Индекс массы тела
weight = float(input("Введите вес (в кг): "))
