# Задача 1. Квадраты чисел

for i in range(11):
	print(i ** 2)

# Задача 2. Кукушка

hour = int(input("Введите час: "))
text = 'Ку-ку!'
for i in range(hour):
	print(text)

# Задача 3. Любовь с первой цифры (цикл for)

for i in range(21):
	print(2 ** i)
